InformationRegisters/ПЛ_СоответствиеСФронтСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПЛ_СоответствиеСФронтСистемами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПЛ_ТипыОбъектовФронтСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВлияетНаУчетТМЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПЛ_ТипыОбъектовФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФронтСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ТипыФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПЛ_СоответствиеСФронтСистемами/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//<< Портал-Юг Баринов 2019.02.26 [6.2.13 Регистр сведений «Соответствие с Front-системами»]
// Номенклатура в регистре используется без характеристики, т.к. документ "питДанныеПродажФронта" не поддерживает характеристики (релиз 2.4.6.174). Регистр нужен для заполнения этого документа.
//>> Портал-Юг Баринов 2019.02.26
	
#Область ОбработчикиСобытий

//<< Портал-Юг Баринов 2019.02.26 [6.2.13 Регистр сведений «Соответствие с Front-системами»]
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Количество должно быть заполнено, если заполнен объект и установлен соответствующий флаг в типе объекта.
	СтрокиСПустымКоличеством = Новый Массив;
	ТипыОбъектов = Новый Массив;
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Объект) И ЗначениеЗаполнено(Запись.ТипОбъекта) И Не ЗначениеЗаполнено(Запись.Количество) Тогда 
			СтрокиСПустымКоличеством.Добавить(Запись);
			ТипыОбъектов.Добавить(Запись.ТипОбъекта);
		КонецЕсли;	
	КонецЦикла; 
		
	Если СтрокиСПустымКоличеством.Количество() Тогда 
		
		ШаблонСообщения = НСтр("ru='Поле ""%Количество%"" не заполнено'");
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Количество%", НСтр("ru = 'Количество'"));
	    		
		УказыватьКоличество = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТипыОбъектов, "УказыватьКоличество");
		Для каждого Запись Из СтрокиСПустымКоличеством Цикл
			Если УказыватьКоличество[Запись.ТипОбъекта] = Истина Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Количество", "Запись", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;			

КонецПроцедуры //>> Портал-Юг Баринов 2019.02.26

//<< Портал-Юг Баринов 2019.02.26 [6.2.13 Регистр сведений «Соответствие с Front-системами»]
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;	
	КонецЕсли;	
	
	Для каждого Запись Из ЭтотОбъект Цикл
	
		Если Не ЗначениеЗаполнено(Запись.Объект) Тогда
			// Для исключения разных значений пустого реквизита. Например, пустых ссылок разных типов
			Запись.Объект = Неопределено;
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры //>> Портал-Юг Баринов 2019.02.26

#КонецОбласти

#КонецЕсли
